Repository: 84000/data-translation-memory
Catalog: toh562-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་ཀུན་མཁྱེན་སྟོན་པ་པོ། །སེམས་ཅན་ཀུན་ལ་ཐུགས་བརྩེ་བས། །གནོད་སྦྱིན་སྲིན་པོ་དྲི་ཟ་དང་། །ཀླུ་དང་མཁའ་ལྡིང་གསང་བ་པ། །འབྱུང་པོ་རྒྱུ་བ་གཟི་བྱིན་འཕྲོག །གྲུལ་བུམ་ཡི་དགས་སྲུལ་པོ་དང་། །ལྷ་མིན་གཤེད་བྱེད་རོ་ལངས་དང་། །བརྗེད་བྱེད་དང་ནི་མི་འམ་ཅི། །སྐེམ་བྱེད་དང་ནི་རིམས་དྲག་དང་། །དེ་བཞིན་བྲམ་ཟེ་སྲིན་པོ་དང་། །སྨྱོ་བྱེད་རིམས་ནད་ཞག་གསུམ་པ། །དེ་བཞིན་ཞག་ནི་བཞི་པ་རྣམས། །སྐྲག་ཅིང་རབ་ཏུ་འདར་འགྱུར་ཏེ། །ཕྱོགས་བཅུར་རྒྱུག་པ་གཟིགས་ནས་ཀྱང་།
en: Then, the all-knowing Teacher, Who has compassion for all sentient beings, Saw the yakṣas, rākṣasas, gandharvas, Nāgas, garuḍas, guhyakas, Bhūtas, wanderers, stealers of vitality, Kumbhāṇḍas, pretas, pūtanas, Asuras, kṛtyas, vetālas, Apasmāras, kinnaras, Skandas, intense fevers, Brahmins, rākṣasas, Unmādas, three-day fevers, And four-day fevers Grow afraid, tremble, And scurry into the ten directions.

source: །དེ་དག་ལ་ནི་ཐུགས་བརྩེའི་ཕྱིར། །རིག་སྔགས་འདི་ནི་བརྗོད་པར་མཛད། །སྱཱད་ཡ་ཐེ་དན། ཧི་རི་མ་ཁ། ཏི་རི་ཁ་ཁ། ཀ་ཊ་མ་ཊཱ། སིད་དྷ་མ་ཧཱ། ཧ་ཏ་རི། ཨུ་ཊ་ཏ་ནི། ད་ཊ་ད་ཊ། ད་ཏི་ལི། ད་མཏྟེ། ད་མཏྟེ། དྷུ་དྷུ་རི། ད་ད་རི། ད་ར་མི་ར། ཀི་རི་ཀཱི་ཡེ། ཀ་ཏ་བ་རེ་ཎི། སུ་སུ་མཱ་ལེ་སྭཱ་ཧཱ། གསང་སྔགས་ཆེན་པོ་རིག་སྔགས་ཆེན་པོ་འདི་ལས་འགལ་བར་མ་བྱེད་ཅིག །
en: Feeling compassion for them, He uttered this vidyā-mantra: Syād yathedam hirimakha tirikhakha kaṭamaṭā siddhamahāhatari uṭatani daṭa daṭa datili damatte damatte dhūdhūri dadari daramira kirikīye katavareṇi susumāle svāhā Do not transgress this great mantra, this great vidyā-mantra.

source: བཅོམ་ལྡན་འདས་ཀྱི་གསུང་གི་ཆོས་ལ་ཡང་དག་པར་སོ་སོར་རྟོགས་ཤིག །
en: Understand perfectly and precisely the Dharma spoken by the Blessed One, or all your bodies will collapse.

source: ཁྱེད་ཀུན་ལུས་ཞིག་སྟེ་ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་ཞིང་འཁོར་བར་འགྲོ་བ་རེ།
en: After you die you will all be born among hell beings who have fallen into lower realms, and you will continue to roam there.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བཅོམ་ལྡན་འདས་ཀྱི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་སྔོན་མ་ཐོས་པ་འདི་ཐོས་ནས་སྐྲག་ཅིང་དངངས་ཏེ་མི་དགའ་ལ་སྐྱི་བུང་ཞེས་བྱེད་ནས་ཐལ་མོ་སྦྱར་ཏེ།
en: When the Four Great Kings heard the Blessed One’s great king of vidyā-mantras, which had never before been heard, they were frightened and anxious.

source: བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཞིང་གྲོས་མཐུན་པ་དང་།
en: Bristling with uneasiness, they joined their palms and paid homage to the Blessed One.

source: ཚིག་མཐུན་པ་དང་། སྐད་མཐུན་པར་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །སྡང་བའི་འབྱུང་པོ་ཟད་བགྱིད་པ། །རིག་སྔགས་འདི་ནི་ལེགས་པར་གསུངས།
en: Unified in sense, phrasing, and tone, they said: “Well spoken was the vidyā-mantra That vanquishes hostile bhūtas.

source: །མི་ཡི་འཇིག་རྟེན་བདེ་བགྱིད་པའི། །རིག་སྔགས་བདག་ཅག་བརྗོད་པར་འཚལ།
en: We must convey a vidyā-mantra That ensures the well-being of the world of humans.

source: །དེ་ལ་རིག་སྔགས་འདི་ལགས་ཏེ། །འཇིག་རྟེན་མགོན་པོ་བདག་ལ་གསོན། །སྱཱད་ཡ་ཐེ་དན། ཨུ་ཧུ་ཧ་ལ། ཀུ་ལི་ཛི་བ་ཨ་བྷུ་ཡ། མ་སུ་ར་བེ་ལ། ཨད་དྱཱ་བད་དྱཱ། ཨད་དྱཱ་བ་ཏེ། ནད་ད་བད་དྱེ། མ་རུ་དྷྱ། མ་རུ་དྷྱ། བ་དེ་མ་རུ་ད་དྱ་ཕ་ལ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་འབྱུང་པོ་ཐམས་ཅད་བཟློག་པ་འདི་གཟུང་བར་གསོལ། སྱཱད་ཡ་ཐེ་དན། ཨི་ལི་ཨི་ལི། མི་ལི་མི་ལི། ཀི་ལི་ཀི་ལི། བ་ན་ར། ནི་ལ་པ་ཡ། བྷུ་བྷུ་བྷུ་ར། ཐི་རཱུ་ཕུ་ཕུ་ཕུ་ར། ག་ཤ་ལཱི།
en: The following is that vidyā-mantra, So please pay heed to us, world protector.

source: རཽ་ཁ་ད་ཡ་མ་ལ། ཁུ་ལི་ཁུ་ལི་བ་ཡ་སྭཱ་ཧཱ། རིག་སྔགས་ཀྱི་རྒྱལ་མོ་འདི་ནི་ལོ་གཅིག་གི་བར་དུ་མཚམས་གཅོད་པ་དང་། འབྱུང་པོ་ཐམས་ཅད་བཟློག་པ་དང་། དོན་ཐམས་ཅད་གྲུབ་པ་ལགས་སོ།
en: Syād yathedam uhuhala kulijiva abhuya masuravela addyā vaddyā addyā vate nadda vaddye marudya marudya vade maruddya phala svāhā “Blessed One, please accept the following, which repels all bhūtas: Syād yathedam ili ili mili mili kili kili vanara nilapaya bhubhubhura thirū phuphuphura gaśalī raukhadayamala khuli khulivaya svāhā “This king of vidyā-mantras establishes a boundary, repels all bhūtas, and accomplishes all aims for one year.”

source: །དེ་ནས་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། དྲི་ཟ་ནས་གནོད་པར་བགྱིད་པའི་བར་རྣམས་ཀྱིས། བཅོམ་ལྡན་འདས་ཀྱི་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་སྔོན་མ་ཐོས་པ་འདི་ཡང་ཐོས། རྒྱལ་པོ་ཆེན་པོ་བཞིའི་བསྲུང་བ་སྔོན་མ་ཐོས་པ་འདི་ཡང་ཐོས་ནས་སྐྲག་ཅིང་དངངས་ལ་མི་དགའ་སྟེ།
en: When all the beings from yakṣas, rākṣasas, and gandharvas all the way up to harm doers heard the Blessed One’s great king of vidyā-mantras, which had never before been heard, and when they heard the Four Kings’ protection, which had never before been heard, they were frightened and anxious.

source: སྐྱི་བུང་ཞེས་བྱེད་ནས་ས་ལ་འཛུལ་ཀུན་ཏུ་འཛུལ།
en: Bristling with uneasiness, they burrowed deep into the earth.

source: ཀུན་ཏུ་རབ་ཏུ་འཛུལ་བར་བྱེད་དོ།
en: They were compelled to burrow deep.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ས་གཞི་རྡོ་རྗེར་སྤྲུལ་ནས་དེ་དག་ཕྱོགས་བཞིར་རྒྱུག་གོ།
en: The Blessed One then transformed the ground into vajra, so they scurried in the four directions.

source: །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་ཕྱོགས་བཞིར་མེའི་ཕུང་པོ་ཆེན་པོ་སྤྲུལ་ཏོ། །དེ་ནས་ནམ་མཁའ་ལ་རྒྱུག་གོ།
en: The Four Great Kings then manifested massive heaps of flames in the four directions, so the beings fled into the sky.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ནམ་མཁའ་གསེར་དུ་སྤྲུལ་ཏོ།
en: Next, the Blessed One transformed the sky into gold.

source: །དེ་ནས་འཇིག་རྟེན་སྐྱོང་བ་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་ལྷ་དང་དྲི་ཟས་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ། སྟེང་གི་བར་སྣང་ལ་འཕགས་ནས་གནོད་སྦྱིན་དང་སྲིན་པོ་ནས་གནོད་པར་བྱེད་པའི་བར་རྣམས་གཞོམ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བ་དང་། འབྱུང་པོ་ཐམས་ཅད་བཟློག་པ་དང་།
en: The great king Vaiśravaṇa, guardian of the world, surrounded and attended to by gods and gandharvas, rose up into the sky.

source: འཁོར་བཞི་པོ་རྣམས་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦ་བ་དང་། བདེ་ལེགས་སུ་འགྱུར་བ་དང་། བདེ་བར་གནས་པར་བྱ་བའི་ཕྱིར་རིག་སྔགས་འདི་བརྗོད་དོ། །སྱཱད་ཡ་ཐེ་དན། གི་མི་གི་མི་གི་མི་གི་མི། གི་ནི་གི་ནི་གི་ནི་གི་ནི། ན་ཁི་མི་ན་ཁི། ནི་ཥ་ནི་ཥ་ནི་ཥ། ཨུ་བ་ཨ། དི་ཤྭ་དི་ཤྭ། བི་དི་ཤ། སརྦ་དི་ཤྭ།
en: To vanquish everyone from yakṣas and rākṣasas up to harm doers, to care for all sentient beings, to repel all bhūtas, and to guard, protect, and shield the four communities and ensure their happiness and well-being so that they could dwell at ease, he uttered the following vidyā-mantra: Syād yathedam gimi gimi gimi gimi gini gini gini gini nakhi minakhi niṣa niṣa niṣa uva u diśva diśva vidiśa sarvadiśva adhivati gira visa jani bhumipati ililī ililī kililī kili kililī kili kililī kili kililī kili kililī kili kilili kilili lililili kilili lililililili addhyi naddyi kunaddhyi mahākunaddyi kuladdyi khuladdyi khukhuladdyi mahākhuladdyi hulu hulu lu hulululu hululululu hululululu lu hulululululululululu lu hala hala hili hili laha halu hule iha hule hule uladdyi hile uhahile hila hile hulu hi hulu hulu hulu hulu hule hahahahahaha svāhā May the great king Vaiśravaṇa guard this direction.

source: ཨ་དྷི་བ་ཏི། གི་ར། བི་ས། ཛ་ནི་བྷུ་མི་པ་ཏི། ཨི་ལི་ལཱི། ཨི་ལི་ལཱི། ཀི་ལི་ལཱི། ཀི་ལི་ཀི་ལི་ལཱི། ཀི་ལི་ཀི་ལི་ལཱི། ཀི་ལི་ཀི་ལི་ལཱི། ཀི་ལི་ཀི་ལི་ལཱི། ཀི་ལི་ཀི་ལི་ལི། ཀི་ལི་ལི་ལི་ལི་ལི་ལི། ཀི་ལི་ལི་ལི་ལི་ལི་ལི་ལི་ལི། ཨད་དྱི། ནད་དྱི། ཀུ་ནད་དྱི། མ་ཧཱ་ཀུ་ནད་དྱི། ཀུ་ལད་དྱི་ཁུ་ལད་དྱི། ཁུ་ཁུ་ལད་དྱི་མ་ཧཱ་ཁུ་ལད་དྱི། ཧུ་ལུ་ཧུ་ལུ། ལུ། ཧུ་ལུ་ལུ་ལུ། ཧུ་ལུ་ལུ་ལུ་ལུ། ཧུ་ལུ་ལུ་ལུ་ལུ། ལུ། ཧུ་ལུ་ལུ་ལུ་ལུ་ལུ་ལུ་ལུ་ལུ་ལུ། ལུ། ཧ་ལ་ཧ་ལ། ཧི་ལི་ཧི་ལི། ལ་ཧ་ཧ་ལུ། ཧུ་ལེ།
en: Vāsava, the king of all gods, has come.

source: ཨི་ཧ། ཧུ་ལེ་ཧུ་ལེ། ཨུ་ལད་ཏྱི། ཧི་ལེ། ཨུ་ཧ་ཧི་ལེ། ཧི་ལ་ཧི་ལེ། ཧུ་ལུ། ཧི། ཧུ་ལུ་ཧུ་ལུ་ཧུ་ལུ། ཧུ་ལུ་ཧུ་ལེ། ཧ་ཧ་ཧ་ཧ་ཧ་ཧ། སྭཱ་ཧཱ། རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་ཕྱོགས་སྐྱོང་བར་གྱུར་ཅིག །ལྷ་རྣམས་ཀྱི་ནང་ན་ལྷའི་རྒྱལ་པོ་ནོར་ལྷའི་བུ་ཞེས་བགྱི་བ་མཆིས་ཏེ།
en: I pay homage to him.

source: དེ་ལ་བདག་ཕྱག་འཚལ་ལོ། །དེ་ཡང་བཅོམ་ལྡན་འདས་ཉིད་ལ་ཕྱག་འཚལ་ཏེ། རྫོགས་པའི་སངས་རྒྱས་དཔའ་བོ་སྟེ། །ཀུན་མཁྱེན་ཀུན་གཟིགས་ཁྱོད་ལ་འདུད།
en: He, too, pays homage to the Blessed One: “Heroic perfect Buddha, All seeing and all knowing—I bow to you.

source: །རྫོགས་པའི་སངས་རྒྱས་རྐང་གཉིས་མཆོག །ཤེས་རབ་ཆེན་པོ་ཁྱོད་ལ་འདུད།
en: Perfect Buddha, supreme among bipeds, Endowed with great wisdom—I bow to you. “

source: །གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། དྲི་ཟ་ནས་གནོད་པར་བགྱིད་པའི་བར་རྣམས་མིང་འདི་ཞེས་བྱ་བའི་ལུས་ལ་བབས་པ་ལས་གུད་དུ་དེང་ཤིག །
en: May everyone from yakṣas, rākṣasas, and gandharvas all the way up to harm doers depart from the body of so-and-so, which they have inhabited.

source: གལ་ཏེ་མིང་འདི་ཞེས་བྱ་བའི་ལུས་ལས་མྱུར་དུ་གུད་དུ་མ་དོང་ན། དེ་དག་ལ་མྱུར་དུ་འཇིགས་པ་ཆེན་པོ་དང་། ནད་དྲག་པོས་འདེབས་པར་འགྱུར་ལ། དེའི་རྐྱེན་གྱིས་མགོ་བོ་དང་། སྙིང་ཚལ་པ་བརྒྱར་འགས་པར་འགྱུར་ཏེ། དེའི་མོད་ལ་སྡུག་བསྔལ་དུ་མ་འབྱུང་བ་དང་བརླག་པ་དང་མཐའ་མེད་པར་འགྱུར་རོ།
en: If they do not quickly depart from so-and-so’s body, they will soon be in grave peril and afflicted with severe illness, which will cause their heads and hearts to split into a hundred pieces, immediately bringing them many kinds of misery and total ruin.

source: །འབྲུམ་བུའི་གདོན་གང་ཡིན་པ་དང་། སྐྱ་རེངས་འཆར་ཀའི་གདོན་གང་ཡིན་པ་དང་། གྲིབ་གནོན་གྱི་གདོན་གང་ཡིན་པ་དེ་དག་ཀྱང་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་ཐོས་ནས་མིང་འདི་ཞེས་བྱ་བའི་ལུས་ལས་མྱུར་དུ་གུད་དུ་དེང་ཤིག །
en: May the grahas of pox, grahas of the dawn, and grahas of shadow quickly depart so-and-so’s body upon hearing this Great Sūtra of Cool Grove.

source: གལ་ཏེ་མྱུར་དུ་གུད་དུ་མ་དོང་ན་དེ་དག་ལ་མྱུར་དུ་འཇིགས་པ་ཆེན་པོ་དང་། ནད་དྲག་པོས་འདེབས་པར་འགྱུར་ལ། དེའི་རྐྱེན་གྱིས་མགོ་བོ་དང་། སྙིང་ཚལ་པ་བརྒྱར་འགས་པར་འགྱུར་ཏེ། དེའི་མོད་ལ་སྡུག་བསྔལ་དུ་མ་འབྱུང་བ་དང་།
en: If they do not quickly depart, they will soon be in grave peril and afflicted with severe illness, which will cause their heads and hearts to split into a hundred pieces, immediately bringing them many kinds of misery and total ruin.

source: བརླག་པ་དང་མཐའ་མེད་པར་འགྱུར་རོ། །གཟི་བྱིན་དང་ནི་ཁྲག་ཟ་བ། །ཉིན་མཚན་རྒྱུ་བ་གང་ཡིན་པ། །དེ་དག་གིས་ཀྱང་ལེགས་གསུངས་པའི། །མདོ་བཤད་ཐོས་ནས་གཏང་བར་གྱིས།
en: All those who flit about day and night, Devouring vitality and blood, Are forced to cease upon hearing This well-spoken sūtra propounded.

source: །ཤ་ཟ་ལུས་འཕགས་སྐེམ་བྱེད་དང་། །འབྱུང་པོ་འཇིགས་བྱེད་སྲུལ་པོ་རྣམས། །དེ་དག་གིས་ཀྱང་ལེགས་གསུངས་པའི། །མདོ་འདི་བཤད་པ་ཐོས་ནས་ཐོང་།
en: All piśācas, skandas, bodiless beings, Bhūtas, frightful ones, and pūtanas Must cease upon hearing This well-spoken sūtra propounded.

source: །ལྷ་དང་ལྷ་མིན་རླུང་ལྷ་དང་། །དྲི་ཟ་དང་ནི་གདོན་གྱི་བླ། །འབྱུང་པོ་དང་ནི་ཤ་ཟ་དང་། །དེ་བཞིན་གནོད་སྦྱིན་སྲིན་པོ་རྣམས། །ཀུན་ཏུ་འཁྲུགས་ཤིང་ཀུན་ཏུ་གཡོས།
en: All gods, asuras, marutas, Gandharvas, most eminent grahas, Bhūtas, piśācas, Yakṣas, and rākṣasas Will tremble in confusion And shiver with fear.

source: །སྐྲག་ཅིང་ཀུན་ཏུ་རབ་ཏུ་འགུལ། །གདོན་སྡང་གནོད་པ་བྱེད་པ་རྣམས། །ལྟུང་ཞིང་རབ་ཏུ་ཕམ་པར་འགྱུར།
en: All spiteful and harmful grahas Will fall and be defeated.

source: །ས་གཞི་དག་ཀྱང་རབ་ཏུ་གཡོས། །སྒྲ་བོ་ཆེ་དག་སྒྲོགས་པར་བྱེད།
en: The ground will quake, And loud noises will ring out.

source: །ཡི་དགས་དང་ནི་གྲུལ་བུམ་རྣམས། །སྡང་བའི་གདོན་ནི་ཟློག་བྱེད་པའི། །མདོ་འདི་དག་ནི་ཐོས་གྱུར་ནས། །འཇིགས་པ་དྲག་པོས་འདེབས་པར་འགྱུར།
en: When pretas and kumbhāṇḍas Hear this sūtra, Which repels spiteful grahas, They will be struck with grave fear.

source: །སངས་རྒྱས་ཆོས་དང་དགེ་འདུན་ལ། །དད་པའི་གནོད་སྦྱིན་གང་ཡིན་པ། །དེ་དག་མགུ་ཞིང་ཡིད་དགའ་ནས། །ལེགས་པར་རྗེས་སུ་ཡི་རང་ངོ་།
en: Those yakṣas who have trust In the Buddha, Dharma, and Saṅgha Will be delighted and pleased And will thoroughly rejoice.

source: །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་བར་སྣང་ལས་བབས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཞིང་། གྲོས་མཐུན་པ་དང་།
en: The Four Great Kings then descended from the sky and approached the Blessed One.

source: ཚིག་མཐུན་པར་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་རྒྱལ་པོ་ཆེན་པོ་བཞིས་ཞབས་ལ་ཕྱག་བགྱིས་པ་དང་། འཁོར་བཞི་པོ་རྣམས་སྲུང་བ་དང་། ཡོངས་སུ་སྐྱོབ་པ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་ནས་གནོད་པར་བགྱིད་པའི་བར་རྣམས་འཇོམས་པ་ལགས་སོ།
en: They bowed their heads to the Blessed One‘s feet, joined their palms, and spoke with unified sentiment and phrasing: “Venerable Blessed One, this Great Sūtra of Cool Grove that is revered by the Four Great Kings guards and protects the four communities and vanquishes all beings from yakṣas and rākṣasas all the way up to harm doers.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་གང་ལ་བསྲུང་བ་དང་། དེ་དག་གིས་ཀྱང་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་གཟུང་བར་བགྱི།
en: Venerable Blessed One, since it protects any monk, nun, layman, or laywoman, everyone should receive this Great Sūtra of Cool Grove.

source: བཅང་བར་བགྱི། བརྗོད་པར་བགྱི། ཀུན་ཆུབ་པར་བགྱིའོ།
en: They should hold on to it, recite it, and master it.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་ལ་ལ་བདག་བསྲུང་བ་དང་། བདག་སྦ་བ་དང་། གཞན་བསྲུང་བ་དང་། གཞན་སྦ་བའི་སླད་དུ་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་།
en: Venerable Blessed One, if no being, from yakṣas and rākṣasas all the way up to harm doers, will so much as dwell near monks, nuns, laymen, or laywomen who receive, hold, recite, and master this Great Sūtra of Cool Grove in order to protect and shield themselves or others, then what harm could they possibly do?

source: བརྗོད་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དེ་ལ་ནི་གནོད་སྦྱིན་དང་། སྲིན་པོ་ནས་གནོད་པར་བགྱིད་པའི་བར་རྣམས་ཉེ་འཁོར་དུ་ཡང་གནས་པར་མི་འགྱུར་ན། གནོད་པར་བགྱིད་པ་ལྟ་ག་ལ་སེམས་ལགས། དེ་གང་དུ་མཚན་གཅིག་ཙམ་གནས་པ་དེར་ཡང་གནོད་སྦྱིན་དང་། སྲིན་པོ་ནས་གནོད་པ་བགྱིད་པའི་བར་རྣམས་ཉེ་འཁོར་དུ་ཡང་གནས་པར་མི་འགྱུར་ན། དེ་གང་དུ་རྟག་ཏུ་གནས་པ་དེར་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ལགས།
en: If no being, from yakṣas and rākṣasas all the way up to harm doers, can dwell for so much as a night in their vicinity, what need is there to mention remaining there permanently?

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གང་ལ་མི་མ་ལགས་པའི་གནོད་པས་ཐེབས་པ་དེའི་མདུན་དུ་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་བརྗོད་ན། དེ་མྱུར་བ་ཁོ་ནར་བདེ་ལེགས་དང་། ནད་མ་མཆིས་པ་དང་། བདེ་བར་འགྱུར་ཞིང་ཐར་བར་འགྱུར་ལ།
en: Venerable Blessed One, when this Great Sūtra of Cool Grove is recited in front of someone harmed by a nonhuman, the person quickly gains happiness and well-being and is free of pain, comfortable, and released from their affliction.

source: མི་མ་ལགས་པ་རྣམས་དེ་ལ་ལོག་པ་མི་བགྱིད་ཅིང་མྱུར་དུ་གུད་དུ་མཆི་བར་འགྱུར་ལགས་ཏེ།
en: The nonhuman cannot return but will immediately depart.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་དེ་ལྟར་དོན་ཆེ་བ་ལགས་སོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་ལ་ལ་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་།
en: Venerable Blessed One, such is the great benefit of this Great Sūtra of Cool Grove. “

source: བརྗོད་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། སྦྱོར་བར་བགྱིད་པ་དེ་ལ་ནི་དད་པ་ཅན་གྱི་གནོད་སྦྱིན་དགེ་བསྙེན་རྣམས་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་གནས་སུ་མཆིས་ནས་མིང་སྨོས་པར་བགྱིད་དེ། ཀྱེ་རྒྱལ་བོ་ཆེན་པོ་དག་དགེ་སློང་ངམ། དགེ་སློང་མའམ།
en: Venerable Blessed One, devout yakṣa laymen will travel to the abodes of the Four Great Kings and speak the name of any monk, nun, layman, or laywoman who receives, holds, recites, masters, and uses this Great Sūtra of Cool Grove.

source: དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་ཆེ་གེ་མོ་ཞིག་བདག་བསྲུང་བ་དང་། བདག་སྦ་བ་དང་། གཞན་བསྲུང་བ་དང་། གཞན་སྦ་བའི་ཕྱིར་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་འཛིན་པར་བྱེད།
en: They will announce, ‘Four Great Kings, the monk, nun, layman, or laywoman so-and-so is receiving, holding, reciting, mastering, and using this Great Sūtra of Cool Grove in order to protect and shield themself and others.’ “

source: འཆང་བར་བྱེད། རྗོད་པར་བྱེད། ཀུན་ཆུབ་པར་བྱེད། སྦྱོར་བར་བྱེད་དོ་ཞེས་སྒྲོགས་པར་བགྱིད་ལགས་སོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དད་པ་ཅན་གྱི་གནོད་སྦྱིན་དགེ་བསྙེན་རྣམས་རྒྱལ་པོའི་ཕོ་བྲང་ལྕང་ལོ་ཅན་དུ་མཆིས་ནས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུའི་མདུན་དུ་གནོད་སྦྱིན་རྣམས་འདུས་ཤིང་འབྱུང་པོ་ཐམས་ཅད་ཚོགས་པའི་ནང་དུ་ཡང་བསྒྲགས་ནས།
en: Venerable Blessed One, devout yakṣa laymen will travel to the royal palace in Aḍakavatī, where they will also announce this amid all the yakṣas and bhūtas assembled and gathered before the great king Vaiśravaṇa.

source: དེར་དེ་དག་མངོན་པར་དགའ་བར་འགྱུར་ཏེ།
en: It will bring joy to those present.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་ནི་དེ་ལྟར་དོན་ཆེ་བ་ལགས་སོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ།
en: Venerable Blessed One, such is the great benefit of this Great Sūtra of Cool Grove. “

source: དགེ་བསྙེན་མ་གང་ལ་ལ་བདག་བསྲུང་བ་དང་། བདག་སྦ་བ་དང་། གཞན་བསྲུང་བ་དང་། གཞན་སྦ་བའི་སླད་དུ་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། བརྗོད་པ་དང་ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། སྦྱོར་བར་བགྱིད་པ་དེ་ནི་ཚངས་པར་སྤྱད་པར་བགྱིའོ།
en: Venerable Blessed One, any monk, nun, layman, or laywoman who receives, holds, recites, masters, and uses this Great Sūtra of Cool Grove to protect and shield themself and others will practice abstinence.

source: །ཆང་མི་བཏུང་བ་དང་། དྲན་པ་དང་། ཤེས་བཞིན་ཅན་དུ་མཆིས་པ་དང་།
en: They will not drink alcohol but will observe mindfulness and introspection.

source: ཟས་རྣམ་པ་ལྔ་ལ་འདི་ལྟ་སྟེ། བུ་རམ་དང་། སྦྲང་རྩི་དང་། ཏིལ་དང་། ཤ་དང་། ཉ་ཤ་རྣམས་ཡོངས་སུ་སྤང་བར་བགྱིའོ།
en: They will give up five kinds of food—molasses, honey, sesame, meat, and fish.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གནོད་སྦྱིན་དང་། སྲིན་པོ་ནས་གནོད་པར་བགྱིད་པའི་བར་རྣམས་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། བརྗོད་པ་དང་ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། སྦྱོར་བ་དེ་ལ་དེའི་སྐབས་ཁོ་ནར་བརླག་པ་དང་།
en: It is only under those circumstances, Venerable Blessed One, that beings from yakṣas and rākṣasas all the way up to harm doers can destroy or ceaselessly affect one who receives, holds, recites, masters, and uses this Great Sūtra of Cool Grove.

source: མཐའ་མ་མཆིས་པར་བགྱིད་པ་དག་མཆིས་ཏེ། དེ་དག་གཞོམ་པའི་སླད་དུ་ཡི་དམ་བགྱི་འཚལ་ལགས་སོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་ལ་ལ་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། བརྗོད་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་།
en: In order to destroy them, this vow must be observed. “

source: སྦྱོར་བར་བགྱིད་པ་དེ་ལ་ནི་དད་པ་ཅན་གྱི་གནོད་སྦྱིན་དགེ་བསྙེན་རྣམས་གོས་དང་། ཟས་དང་། མལ་ཆ་དང་། སྟན་དང་། བྲོ་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་སྤྲོ་བ་བསྐྱེད་པར་བགྱིད་དེ།
en: Venerable Blessed One, devout yakṣa laymen will please with clothing, food, bedding, cushions, healing medicines, and necessities any monk, nun, layman, or laywoman who receives, holds, recites, masters, and uses this Great Sūtra of Cool Grove.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་ནི་དེ་ལྟར་དོན་ཆེ་བ་ལགས་སོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གཞན་མུ་སྟེགས་ཅན་བཅོམ་ལྡན་འདས་ཀྱི་གསུང་རབ་ལ་མ་དད་པ་དང་། མངོན་པར་མི་དགའ་བ་དང་། གནོད་པར་འཚལ་བ་དང་། སྨན་པར་མི་འཚལ་བ་དང་། གྲུབ་པ་དང་།
en: Venerable Blessed One, such is the great benefit of this Great Sūtra of Cool Grove. “

source: བདེ་བར་མི་འཚལ་བ་གང་ལ་ལ་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། བརྗོད་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། སྦྱོར་བར་བགྱིད་པ་དེ་ལ་ནི་དོན་དེ་འགྲུབ་པར་མི་བགྱིད་དེ།
en: Venerable Blessed One, a non-Buddhist who lacks devotion to the Blessed One’s doctrine and who dislikes it, wants to impair it, does not want to help it, and does not want it to be successful or thrive cannot prevent the success of one who receives, holds, recites, masters, and uses this Great Sūtra of Cool Grove.

source: མི་མ་ལགས་པ་རྣམས་ཀྱིས་བར་མ་དོར་འགུམས་པ་དང་། སྡུག་བསྔལ་དུ་མ་འབྱུང་བ་དང་། བརླག་པ་དང་། མཐའ་མ་མཆིས་པར་བགྱིད་ལགས་སོ།
en: Rather, nonhuman beings will kill them, cause them various kinds of misery, destroy them, and affect them endlessly.

source: དེ་ནི་དེ་དག་ལ་གནོད་པར་འཚལ་བ་དང་། སྨན་པར་མི་འཚལ་བ་དང་། གྲུབ་པ་དང་། བདེ་བར་མི་འཚལ་བ་ལགས་པའི་སླད་དུ་སྟེ།
en: Because they want to harm, do not want to help, and do not want success or well-being for the practitioner.

source: དེ་དག་ལ་ནི་ལོག་པར་ལྟ་བ་གང་ལགས་པ་དེ་བརླག་པར་བགྱིད་ལགས་སོ།
en: Whoever has such erroneous views is destroyed. “

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་ན་སེམས་ཅན་རྣམས་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། སྦ་བའི་སླད་དུ་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བསྲུང་བ་བགྱིས་པ་གང་ཅི་ཡང་རུང་བའི་བསྲུང་བ་དེ་དག་གི་ནང་ན་ནི་འདི་མཆོག་དང་། གཙོ་བོ་དང་། རབ་མཆོག་ལགས་སོ།
en: Venerable Blessed One, among all of the protections in the world by which the Four Great Kings protect sentient beings in order to guard, protect, and shield them, this sūtra is supreme, primary, and exalted.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞིས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །མི་མཆོག་གང་ཞིག་མདོ་འདི་དག །ཡོངས་སུ་རྫོགས་པར་བསྲུང་བ་དང་། །བདེ་ལེགས་བགྱིད་པ་དེ་ལ་ནི། །སྲིན་པོ་རྣམས་ཀྱང་འཚེ་མི་བགྱིད།
en: The Four Great Kings then spoke these verses to the Blessed One: “Supreme human, Even rākṣasas cannot harm One who is protected And granted well-being by this sūtra. “

source: །སུ་ཡང་རུང་སྟེ་མདོ་འདི་དག །མི་མཆོག་གིས་ནི་གསུངས་པ་བཞིན། །ཡོངས་སུ་རྫོགས་ཤིང་མ་ཆད་པར། །ཤིན་ཏུ་ཚང་བར་འཆང་བགྱིད་ན། །དེ་ལ་གནོད་སྦྱིན་ཡི་དགས་དང་། །འབྱུང་པོ་གྲུལ་བུམ་སྲིན་པོ་དང་།
en: Anyone who upholds these sūtras Perfectly, continuously, And in their entirety, Just as taught by the supreme human, “Cannot be harmed By yakṣas, pretas, bhūtas, Kumbhāṇḍas, rākṣasas, unmādas, Wanderers, nāgas, and the like. “

source: །སྨྱོ་བྱེད་རྒྱུ་བ་ཀླུ་རྣམས་དང་། །དེ་ལྟ་བུ་དག་འཚེ་མི་བགྱིད། །དེ་ལ་མི་མ་ལགས་དང་གདོན། །མྱུར་དུ་གུད་དུ་མཆི་བར་འགྱུར།
en: Nonhumans and grahas Will quickly leave them.

source: །དེ་ལ་ཅིས་ཀྱང་མི་ཚུགས་ཏེ། །དེ་ལ་འཚེ་བར་ཡོང་མི་ནུས།
en: Nothing can affect them, Nor be able to harm them.”

source: །རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་ཡིས། །བཅོམ་ལྡན་ཕྱག་འཚལ་ཞེས་བརྗོད་དེ། །སངས་རྒྱས་ཞབས་ལ་ཕྱག་འཚལ་ནས། །དེ་ཉིད་དུ་ནི་མི་སྣང་གྱུར།
en: The Four Great Kings said, “Homage to the Blessed One,” Then prostrated to his feet And instantly disappeared.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་མཚན་མོ་འདས་ཏེ་ནམ་ལངས་ནས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་བཞུགས་ཏེ་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་མདང་སུམ་རྒྱལ་པོ་ཆེན་པོ་བཞི་བུ་དང་བཅས། བློན་པོ་དང་བཅས། འཁོར་དང་བཅས། མངག་གཞུག་པ་དང་བཅས། ཕོ་ཉ་དང་བཅས། གཡོག་འཁོར་དང་བཅས་པ་ཁ་དོག་འཕགས་པ་དག་ནམ་སྲོས་ནས་ལྷགས་ནས་གྲོས་མཐུན་པར་དུར་ཁྲོད་ཆེན་པོ་བསིལ་བའི་ཚལ་དུ་འོངས་ཏེ།
en: When the night had passed, the Blessed One rose at dawn, took his seat at the front of the monastic assembly, and said to them, “Monks, late last night the Four Great Kings, together with their sons, ministers, entourages, retainers, messengers, and servants, appeared at dusk in their majestic glory, arriving at the great charnel ground of Cool Grove with a single intent.

source: རང་གི་འོད་ཀྱིས་སྣང་བར་བྱས་ནས་ལུས་ངན་དང་། ཡུལ་འཁོར་སྲུང་དང་། མིག་མི་བཟང་དང་། འཕགས་སྐྱེས་པོ་རྣམས་ང་ག་ལ་བ་དེར་འོངས་ཏེ་ལྷགས་ནས། ངའི་རྐང་པ་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Flooding it with their luminosity, Kubera, Dhṛtarāṣṭra, Virūpākṣa, and Virūḍhaka approached me, bowed their heads to my feet, and stood to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས། རྒྱལ་པོ་ཆེན་པོ་བཞིས་ངའི་ཐད་དུ་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་བརྗོད་ནས་དོང་ངོ་།
en: Standing there, the Four Great Kings spoke The Great Sūtra of Cool Grove to me and then departed.

source: །ཁྱོད་ཀྱིས་དེ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ།
en: You should listen well and keep it in mind. I will explain it.” “

source: །བཙུན་པ་དེ་ལྟར་འཚལ་ལོ་ཞེས་གསོལ་ཏེ། དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་མཉན་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་དང་།
en: Venerable one, please do so,” the monks replied, and they listened as the Blessed One spoke.

source: དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་རྣམས་ལ་བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་འདི་རྒྱས་པར་བཤད་དོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། དགེ་སློང་དང་།
en: The Blessed One then explained this Great Sūtra of Cool Grove in detail to the monks, nuns, laymen, and laywomen.

source: དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དེ་དག་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: Once the Blessed One finished speaking on this, the monks, nuns, laymen, and laywomen rejoiced, and they praised what he had said.

source: འདིའི་ཆོ་ག་ནི་ཟས་དཀར་གསུམ་ཟ་བ་དང་། ལེགས་པར་ཁྲུས་བྱས་པ་དང་། སྨྱུང་བ་བྱས་པ་དང་། ཚུལ་ཁྲིམས་དང་། ལྡན་པ་དང་།
en: The ritual procedure for this is as follows: A person who eats the three white foods, has bathed well, fasts, observes discipline, and a holds vast intention should draw images of the Four Great Kings using realgar or red ocher.
